export const instructionsData = {
    minecraftInstruction: {
        title: "ИНСТРУКЦИЯ\n" +
            "КАК ЗАЙТИ НА СЕРВЕР ДЛЯ ИГРЫ В МАЙНКРАФТ",
        description: [
            `1. У тебя должен быть установлен Майнкрафт
    (сервер кроссплатформенный и мультиверсийный):
    Скачать игру можно с официального сайта Tlauncher.
    Если играешь с телефона, то нужно скачать Bedrock XBOX/PE с версий: 1.19.30 | 1.19.40 | 1.19.50 | 1.19.51
    Если играешь с компьютера, то подойдут любые версии от 1.8.8 до 1.19.3, (рекомендуем с 1.17.x - 1.19.x)`,
            `2. Нажми «Сетевая игра» или «Multiplayer»`,
            `3. Нажми «Добавить сервер» или же «Add server»`,
            `4. В поле «Название сервера/Server name» оставь название по умолчанию`,
            `5. В поле «Адрес сервера/Server IP» введи IP адрес, который выдаст организатор (перейти по ссылке
    https://mmage.ru/server/rtk)
    На телефоне Bedrock XBOX/PE есть дополнительное поле (Порт/Port), оставь по умолчанию (19132)`,
            `6. Присоединяйся к добавленному серверу`,
            `7. Пройди систему безопасности, введи 3 цифры с картинки (открыть чат с ПК можно нажав –"T" или "/")`,
            `8. Зарегистрируйся, если не сделал(а) этого заранее или авторизуйся.
    - Регистрация (первый вход) выполняется командой (/reg ПАРОЛЬ ПОВТОР_ПАРОЛЯ), пример /reg besTpswd123 besTpswd123)
    - Авторизация (если уже была пройдена регистрация) выполняется командой (/l ПАРОЛЬ), пример /l besTpswd123
    !!! ЕСЛИ ТЫ НЕ РЕГИСТРИРОВАЛСЯ(АСЬ), А ТЕБЯ ПРОСЯТ ВВЕСТИ ПАРОЛЬ, ТО НУЖНО ПОМЕНЯТЬ НИКНЕЙМ !!!
    Ты успешно зашёл(ла) на сервер! `,
        ]
    } ,
    galleryInstruction: {
            title: "Битва \"Ёлок\"",
            description: [
                "Битва ёлок определит, чей офис сделал самую яркую ёлку.\nПриходи в офис и наряжай зелёную!\nТы можешь сделать украшения своими руками.",
            ]
        }

}