import {DropDownItemProps} from "@/components/DropDownMenu/model/DropDownMenu.types";

export const faqData: DropDownItemProps[] = [
    {
        title: "Информация о начислении баллов на личный счет.",
        description: "За каждое действие на платформе «ИТ-МАГИЯ» вы получаете баллы на личный счет."
    },
    {
        title: "За что можно получить баллы?",
        description: "Регистрация — 100 баллов.\n\nЗаполнение профиля — 10 баллов за поле.\n\nСмена фото — 50 баллов.\n\nТест «Начинающий волшебник» и др. — 100 баллов/1 прохождение.\n\nУчастие в командном квиз-турнире —100 баллов каждому игроку.\n\nСтоимость 1 правильного ответа в «Фэнтези-Интуиция» — 10 баллов."
    },
    {
        title: "Как потратить баллы?",
        description: "«ИТ-МАГИЯ» поощряет активных пользователей платформы и даёт возможность приобрести за баллы виртуальные и физические подарки. Узнать стоимость и приобрести подарок можно в разделе «Личный кабинет». Призы, на которые не хватает баллов вашего личного рейтинга, будут недоступными для покупки."
    },
    {
        title: "Что такое «Фэнтези-Интуиция»?",
        description: "«Фэнтези-Интуиция» состоит из 20 вопросов, которые задаёт ведущий в прямом эфире 23 декабря. Вам будут продемонстрированы персонажи с набором из 4-х характеристик (суперспособности, качества характера, факты биографии и т.п.), из которых лишь одна ему реально соответствует. Задача зрителя: 1) По возможности определить по фото, что это за персонаж\n" +
            "2) Выбрать подходящую характеристику (исходя из своих познаний, либо интуитивно). \n" +
            "Вопросы будут появляться в окне трансляции, кнопки с вариантами ответов — под ним. Выбрать можно только один вариант ответа, нажав на кнопку с выбранным ответом. Каждый верный ответ оценивается в 20 баллов. Баллы начисляются только за правильные ответы."
    },
    {
        title: "Зачем мне участвовать в «Фэнтези-Интуиции» и командном квиз-турнире?",
        description: "Участвуя в «Фэнтези-Интуиции» и командном квиз-турнире, вы можете получить много баллов. Максимальное количество баллов, при условии выбора верных ответов на все вопросы «Фэнтези-Интуиции», может составить 400 баллов. Напомним, баллы можно обменять на виртуальные и физические подарки в разделе «Личный кабинет»."
    },
    {
        title: "Обязательно ли участвовать в «Фэнтези-Интуиции»и командном квиз-турнире?",
        description: "Нет, не обязательно. Но участие увеличивает ваши шансы на приобретение понравившихся сувениров в маркетплейсе  «ИТ-МАГИЯ». Чем больше баллов вам удастся набрать, тем больше сувениров вы сможете на них приобрести."
    },
    {
        title: "Зачем мне проходить тесты на платформе?",
        description: "Ежедневно мы публикуем развлекательные тесты: «Начинающий волшебник», «Надежда Магии» и другие. Прохождение одного теста — это дополнительные баллы на ваш личный счет. Проходите тесты, делайте репосты в социальных сетях и копите баллы для приобретения сувениров от «ИТ-МАГИЯ». Тест можно пройти только 1 раз в день."
    },
    {
        title: "Что требуется для качественного просмотра трансляции?",
        description: "Наличие стабильного и скоростного интернет-подключения (не менее 20 мб/с как для входящего, так и для исходящего трафика)."
    },
    {
        title: "Могу ли я подключиться через wifi?",
        description: "Рекомендуем подключить устройство напрямую к кабелю Интернета или находиться на минимальном расстоянии от wifi-роутера. Требуется наличие стабильного и скоростного интернет-подключения (не менее 20 мб/с как для входящего, так и для исходящего трафика)."
    },
    {
        title: "У меня изображение плохого качества.",
        description: "Во время просмотра онлайн-трансляции нежелательно одновременно обновлять ПО, пользоваться файлообменником или скачивать файлы из Интернета.\n\n*Из-за недостаточной скорости плеер трансляции перестроится на более низкое качество изображения, вследствие чего картинка значительно ухудшится."
    },
    {
        title: "Могу ли я смотреть трансляцию с телефона/планшета?",
        description: "Да, просто пройдите регистрацию на своем устройстве или внесите свои регистрационные данные, если вы уже зарегистрированы на другом устройстве."
    },
    {
        title: "Могу ли я передать свои регистрационные данные коллегам для просмотра трансляции?",
        description: "Да, можете. Но помните, что ответственность за передачу персональных данных в этом случае будет лежать на вас."
    },
    {
        title: "Могу ли я задать вопрос ведущему?",
        description: "Во время трансляции у вас будет возможность задать вопросы ведущим и гостям в студии  – для этого необходимо выбрать чат рядом с плеером и написать там свой вопрос."
    },
    {
        title: "Почему я не получил ответа на мой вопрос?",
        description: "В блоке «Вопросы и ответы» ведущие сами выберут наиболее интересные вопросы и обязательно дадут на них ответы."
    },
    {
        title: "Что делать, если у меня еще остались вопросы по трансляции?",
        description: "Вы можете задать их в чате службы поддержки."
    },
    {
        title: "Будут ли доступны материалы платформы после эфиров?",
        description: "Да, все материалы будут предоставлены для просмотра."
    },
    {
        title: "Нужны ли мне наушники с микрофоном на эфир?",
        description: "Чтобы слушать звук трансляции, вам будет достаточно звука устройства, наушники вы можете использовать при желании. Микрофон не является обязательным."
    },
    {
        title: "Какие данные от меня потребуются для входа на платформу/для возможности задать вопрос?",
        description: "Все пользователи предварительно зарегистрированы на платформе  «ИТ-МАГИЯ». Вы можете заполнить дополнительные поля в личном кабинете по желанию"
    },
    {
        title: "Где можно посмотреть программу?",
        description: "В меню платформы кликните на раздел «Программа»"
    },
    {
        title: "Если я отключусь по ходу мероприятия, можно ли будет потом подключиться?",
        description: "Да, вам нужно полностью закрыть браузер и зайти на сайт заново."
    },
    {
        title: "Через какой браузер лучше смотреть эфир?",
        description: "Рекомендуемыми браузерами для просмотра трансляции являются Yandex, Google Chrome, Microsoft Edge, Opera. Все браузеры должны быть обновлены до актуальной версии."
    }
];