import {QuizStaticContentItem} from "@/widgets/common/Quiz/model/Quiz.types";

export const quizContentData2: QuizStaticContentItem[] = [
    {
        question: "Кто такие маглы?",
        answers: {
            1: "профаны в колдовстве",
            2: "добрые маги",
            3: "злые маги",
            4: "прислуга мага"
        },
        rightAnswer: 1
    },
    {
        question: "Для чего используются слезы птицы Феникс?",
        answers: {
            1: "исцеление ран",
            2: "избавление от слепоты",
            3: "как вкусовая добавка к пище",
            4: "снотворное"
        },
        rightAnswer: 1
    },
    {
        question: "В каком случае домовой становится свободным от своего хозяина?",
        answers: {
            1: "если хозяин подарит ему одежду",
            2: "если сгорит дом",
            3: "если в доме появится кошка",
            4: "по окончанию договора аренды жилья"
        },
        rightAnswer: 1
    },
    {
        question: "Дворянин с особой формой зубов и редкими гастрономическими предпочтениями жил в …" ,
        answers: {
            1: "Пенсильвании",
            2: "Трансильвании",
            3: "Трансваале",
            4: "Тирасполе"
        },
        rightAnswer: 2
    },
    {
        question:  "Главой какого факультета была профессор Макгонагал?" ,
        answers: {
            1: "Слизерин",
            2: "Гриффиндор",
            3: "Пуффендуй",
            4: "Когтевран"
        },
        rightAnswer: 2
    },
    {
        question:  "Как называется цветок, который цветет один раз в году ровно в полночь?" ,
        answers: {
            1: "чертополох",
            2: "цветик-семицветик",
            3: "аленький цветочек",
            4: "папоротник"
        },
        rightAnswer: 4
    },
    {
        question: "Кто выбирает хозяина для волшебной палочки?" ,
        answers: {
            1: "продавец палочек",
            2: "сама палочка",
            3: "каталог палочек",
            4: "искусственный интеллект"
        },
        rightAnswer: 2
    },
    {
        question: "Как звали почти безголовое привидение в Хогвардсе?" ,
        answers: {
            1: "Черный дембель",
            2: "сэр Гарри",
            3: "сэр Николас",
            4: "Серый человек"
        },
        rightAnswer: 3
    },
    {
        question: "Как зовут самое дружелюбное привидение?" ,
        answers: {
            1: "Аспер ",
            2: "Каспер",
            3: "Карлсон",
            4: "Косплей"
        },
        rightAnswer: 2
    }
];