import {QuizStaticContentItem} from "@/widgets/common/Quiz/model/Quiz.types";

export const quizContentData5: QuizStaticContentItem[] = [
    {
        question: "Кто такие маглы?",
        answers: {
            1: "профаны в колдовстве",
            2: "добрые маги",
            3: "злые маги",
            4: "прислуга мага"
        },
        rightAnswer: 1
    },
    {
        question: "Для чего используются слезы птицы Феникс?",
        answers: {
            1: "исцеление ран",
            2: "избавление от слепоты",
            3: "как вкусовая добавка к пище",
            4: "снотворное"
        },
        rightAnswer: 1
    },
    {
        question: "В каком случае домовой становится свободным от своего хозяина?",
        answers: {
            1: "если хозяин подарит ему одежду",
            2: "если сгорит дом",
            3: "если в доме появится кошка",
            4: "по окончанию договора аренды жилья"
        },
        rightAnswer: 1
    },
    {
        question: "Дворянин с особой формой зубов и редкими гастрономическими предпочтениями жил в …" ,
        answers: {
            1: "Пенсильвании",
            2: "Трансильвании",
            3: "Трансваале",
            4: "Тирасполе"
        },
        rightAnswer: 2
    },
    {
        question:  "Главой какого факультета была профессор Макгонагал?" ,
        answers: {
            1: "Слизерин",
            2: "Гриффиндор",
            3: "Пуффендуй",
            4: "Когтевран"
        },
        rightAnswer: 2
    },
    {
        question:  "Как называется цветок, который цветет один раз в году ровно в полночь?" ,
        answers: {
            1: "чертополох",
            2: "цветик-семицветик",
            3: "аленький цветочек",
            4: "папоротник"
        },
        rightAnswer: 4
    },
    {
        question: "Кто выбирает хозяина для волшебной палочки?" ,
        answers: {
            1: "продавец палочек",
            2: "сама палочка",
            3: "каталог палочек",
            4: "искусственный интеллект"
        },
        rightAnswer: 2
    },
    {
        question: "Как звали почти безголовое привидение в Хогвардсе?" ,
        answers: {
            1: "Черный дембель",
            2: "сэр Гарри",
            3: "сэр Николас",
            4: "Серый человек"
        },
        rightAnswer: 3
    },
    {
        question: "Как зовут самое дружелюбное привидение?" ,
        answers: {
            1: "Аспер ",
            2: "Каспер",
            3: "Карлсон",
            4: "Косплей"
        },
        rightAnswer: 2
    },
    {
        question: "Как звали трехголового пса Рубиуса Хагрида?",
        answers: {
            1: "Зверёк",
            2: "Дружок",
            3: "Снежок",
            4: "Пушок"
        },
        rightAnswer: 4
    },
    {
        question: "С какой платформы отправляется Хогвартс-экспресс?",
        answers: {
            1: "7/40",
            2: "9 и 3\\4",
            3: "88",
            4: "666"
        },
        rightAnswer: 2
    },
    {
        question: "Название игры, в которой участники используют метлу и кольца?",
        answers: {
            1: "квидич",
            2: "крикет",
            3: "кёрлинг",
            4: "гвинт"
        },
        rightAnswer: 1
    },
    {
        question: "Какое растение используется для восстановления после заклятия оцепенения?",
        answers: {
            1: "белладонна",
            2: "душица",
            3: "тысячелистник",
            4: "мандрагора"
        },
        rightAnswer: 4
    },
    {
        question: "Остров, где находится Алатырь-камень",
        answers: {
            1: "Остров проклятых",
            2: "Остров Невезения",
            3: "Зеленый остров",
            4: "Остров Буян"
        },
        rightAnswer: 4
    },
    {
        question: "Птица, которую частенько застают за поеданием чужих золотых яблок.",
        answers: {
            1: "Гамаюн",
            2: "Феникс",
            3: "Жар-птица",
            4: "Говроун"
        },
        rightAnswer: 3
    },
    {
        question: "Место, где собираются ведьмы на шабаш?",
        answers: {
            1: "Лысая гора",
            2: "Черные камни",
            3: "Тихий холм",
            4: "Синий утёс"
        },
        rightAnswer: 1
    },
    {
        question: "Как называется волшебная птица с женским лицом, услышав которую можно забыть все на свете?",
        answers: {
            1: "Кивин",
            2: "Сирин",
            3: "Гарпия",
            4: "Синяя птица"
        },
        rightAnswer: 2
    },
    {
        question: "Имя злой колдуньи, которая мастерски варила ураганные зелья",
        answers: {
            1: "Гингема",
            2: "Цирцея",
            3: "Ведьма из Блэр ",
            4: "Малефисента"
        },
        rightAnswer: 1
    },
    {
        question: "Какое пророчество исполнили Питер, Сьюзен, Эдмунд и Люси в фильме «Хроники Нарнии: Лев, Колдунья и Волшебный шкаф»?\"",
        answers: {
            1: "освободили Нарнию от Белой колдуньи",
            2: "освободили Нарнию от Темной колдуньи",
            3: "освободили Нарнию от Белого Лорда",
            4: "освободили Нарнию от Темного Лорда"
        },
        rightAnswer: 1
    },
    {
        question: "Вселенная какого знаменитого книжного цикла состоит из множества параллельных миров?" ,
        answers: {
            1: "Властелин колец",
            2: "Хроники Амбера",
            3: "Хроники Нарнии",
            4: "Волкодав"
        },
        rightAnswer: 2
    },
    {
        question: "В каком из миров живут одичалые и белые ходоки?" ,
        answers: {
            1: "Средиземье",
            2: "Невендаар",
            3: "Вестерос",
            4: "Лукоморье"
        },
        rightAnswer: 3
    },
    {
        question: "В каком цикле герои могут погрузиться в сумрак?" ,
        answers: {
            1: "Звездные войны",
            2: "Дневной и ночной дозоры",
            3: "Вселенная полудня",
            4: "Вселенная Марлвел"
        },
        rightAnswer: 2
    },
    {
        question: "Кто из известных писателей — автор «Плоского мира»?" ,
        answers: {
            1: "Терри Пратчетт",
            2: "Рэй Брэдберри",
            3: "Клайв Стэйплс Льюис",
            4: "Урсула Ле Гуин"
        },
        rightAnswer: 1
    },
    {
        question: "Кто автор книжного цикла о приключениях Конана?" ,
        answers: {
            1: "Стефани Майер",
            2: "Джон Уиндем",
            3: "Филип Пулман",
            4: "Роберт Ирвин"
        },
        rightAnswer: 4
    },
    {
        question: "В каком фэнтези-фильме действие происходит на Пандоре?" ,
        answers: {
            1: "«Аватар»",
            2: "«Дюна»",
            3: "«Джуманджи»",
            4: "«Звездные войны»"
        },
        rightAnswer: 1
    },
    {
        question: "В каком произведении в одном из фантастических миров живут Металлические и Цветные драконы?"  ,
        answers: {
            1: "«Древние свитки»",
            2: "«Забытые королевства»",
            3: "«Сага о копье»",
            4: "«Пепел и сталь»"
        },
        rightAnswer: 3
    },
    {
        question: "В какой игре действие происходит в южном королевстве Аден и северном королевстве Элмор?"  ,
        answers: {
            1: "Warcraft",
            2: "Lineage II",
            3: "Ведьмак",
            4: "Готика"
        },
        rightAnswer: 2
    },
    {
        question: "В какой из игр действие происходит в мире Санктуарий?"  ,
        answers: {
            1: "Dungeons & Dragons",
            2: "Skyrim",
            3: "Kingdom Hearts",
            4: "Diablo"
        },
        rightAnswer: 4
    },
    {
        question: "Какое мифическое существо не имеет ничего общего со львом?"  ,
        answers: {
            1: "сфинкс",
            2: "мантикора",
            3: "наги",
            4: "грифон",
        },
        rightAnswer: 3
    }
];